### Creates Faker Data

In [9]:
from faker import Faker
import pandas as pd
import random

fake = Faker()
num_orders = 1000
num_customers = 500
# num_products = 100
product = ['grass', 'hay', 'corn', 'soybean', 'wheat', 'cabbage', 'alfalfa', 'peonies', 'hibiscus']
product_category = ['implements', 'seed', 'decorative', 'feed', 'produce']

customers = []
for cust_id in range(1, num_customers + 1):
    customers.append({
        'cust_id': cust_id,
        'name': fake.name(),
        'email': fake.email()
    })
print('rando CUSTOMER list generated')

rando CUSTOMER list generated

In [10]:
customers_df = pd.DataFrame(customers)
customers_df

     cust_id                    name                       email
0          1         Charles Holland        jfrazier@example.org
1          2        Angela Christian        wnichols@example.org
2          3            Kelly Miller     mariegarcia@example.com
3          4          Mario Williams    wellsvincent@example.org
4          5            Andrew James         aporter@example.org
..       ...                     ...                         ...
495      496           Mandy Carlson  martingonzalez@example.com
496      497         Joshua Robinson     fullerbarry@example.org
497      498           Janet Watkins        troysosa@example.com
498      499  Jennifer Velazquez DDS       pmartinez@example.org
499      500           Dale Anderson      fdonaldson@example.org

[500 rows x 3 columns]

In [11]:
products = []
for product_id, product in enumerate(product, start=1):
    products.append({
        'product_id': product_id,
        'product_name': product,
        'price': round(random.uniform(1, 100), 2),
        'product_category': random.choice(product_category)
    })
print('rando PRODUCT list generated')

rando PRODUCT list generated

In [12]:
products_df = pd.DataFrame(products)
products_df

   product_id product_name  price product_category
0           1        grass   4.27       decorative
1           2          hay  19.60             feed
2           3         corn  66.35          produce
3           4      soybean  49.35             seed
4           5        wheat  92.44       implements
5           6      cabbage  45.90             feed
6           7      alfalfa  87.43          produce
7           8      peonies  81.33       decorative
8           9     hibiscus  53.71       decorative

In [13]:
orders = []
for order_id in range(1, num_orders + 1):
    orders.append({
        'order_id': order_id,
        'cust_id' : random.choice(customers_df['cust_id'].tolist()),
        'product_id': random.choice(products_df['product_id'].tolist()),
        'order_date': fake.date()
    })
print('rando ORDER list generated')

rando ORDER list generated

In [14]:
orders_df = pd.DataFrame(orders)
orders_df

     order_id  cust_id  product_id  order_date
0           1      485           6  1980-12-30
1           2      244           9  1985-04-22
2           3       67           8  1974-02-05
3           4      294           8  2015-03-27
4           5      317           5  1996-01-13
..        ...      ...         ...         ...
995       996       93           2  2021-04-30
996       997      138           1  1982-02-19
997       998      392           9  2021-09-25
998       999      449           5  2017-10-10
999      1000      320           4  1994-11-15

[1000 rows x 4 columns]

### Sanity Check

In [15]:
assert orders_df['cust_id'].isin(customers_df['cust_id']).all()
assert orders_df['product_id'].isin(products_df['product_id']).all()

### Maps tables to DB

In [17]:
from sqlalchemy import create_engine, text

engine = create_engine('postgresql://admin:admin@localhost:5433/postgres')

orders_table = """create table orders (
	order_id int generated always as identity primary key,
	cust_id int,
	order_date date,
	product_id int
);"""

with engine.connect() as conn :
    conn.execute(text(orders_table))
    conn.commit()

In [18]:
products_table = """create table products (
	product_id int generated always as identity primary key,
	product_name varchar,
	price float,
	product_cat varchar
);"""
with engine.connect() as conn :
    conn.execute(text(products_table))
    conn.commit()

In [19]:
customers_table = """create table customers (
	customer_id int generated always as identity primary key,
	name varchar,
	email varchar
);"""
with engine.connect() as conn:
    conn.execute(text(customers_table))
    conn.commit()

### Loads data to DB

In [20]:
# Customers Data
customers_df.to_sql('customers', engine, if_exists='replace', index=False)

500

In [21]:
# Orders Data
orders_df.to_sql('orders', engine, if_exists='replace', index=False)

1000

In [22]:
# Products Data
products_df.to_sql('products', engine, if_exists='replace', index=False)

9